{
  "home": [
    {
      "text": {
        "title": "¿Qué es Harmonic?",
        "content": "<b>Harmonic</b> es un proyecto realizado con el objetivo de llevar la física al mayor número de personas posible. En los apartados superiores se exponen diferentes modelos físicos, en este caso movimientos armónicos, expuestos y explicados a través de simulaciones."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }, 
    {
      "text": {
        "title": "",
        "content": "La web se encuentra dividia en: <br/><ul><li><b>2D</b>: Movimientos en dos dimensiones</li><li><b>3D</b>: Movimientos en tres dimensiones</li><li><b>Math tools</b>: Información a cerca de los métodos matemáticos usados para realizar las simulaciones.</li><ul>"
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }, 
    {
      "text": {
        "title": "Movimiento armónico simple",
        "content": "Antes de adentrarnos en las simulaciones, debemos conocer el concepto básico sobre el que todas ellas se sustentan. Un objeto realiza un movimiento armónico simple (MAS) cuando su desplazamiento en función del tiempo está definido por la siguiente expresión."
      },
      "image": {
        "src": "inicio/image091.png",
        "alt": "Figura 1: Expresión del movimiento armónico simple"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Siendo A la amplitud del movimiento, ω la frecuencia angular y φ el desplazamiento del ángulo, o desfase. El término ωt + φ comprende el ángulo en el tiempo t , conocido como fase. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Tras definir los términos podemos observar como A es un modulador de la amplitud del seno, que siempre se desplaza entre dos valores [1, -1], acotando el movimiento a ±A . Este movimiento se realiza de manera periódica gracias al seno en la fórmula y se puede definir con la siguiente expresión, siendo este el tiempo que tarda el cuerpo en volver hasta su posición inicial tras un ciclo de movimiento. "
      },
      "image": {
        "src": "inicio/image098.png",
        "alt": "Figura 2: Expresión del periodo en un MAS"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Podemos por tanto concluir con que un sistema que describa un MAS oscila con un periodo P en el rango que defina la amplitud. La fuerza en un MAS es conservativa, es decir, la diferencia de energías potenciales final e inicial siempre es 0, en caso de no existir rozamiento. Además, la energía potencial será máxima en los extremos, x=A, siendo correspondiente a la energía total del sistema. Por el contrario, en la posición x=0, la energía potencial será 0. También la energía mecánica total, E_p  + E_k, se mantendrá siempre constante"
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Un concepto importante respecto a un MAS es que nos encontramos ante un sistema lineal, en el que existe una relación directa entre velocidad y desplazamiento. Siempre existirá una fuerza igual y contraria que restaure el sistema a su estado inicial. Más adelante veremos esto representado en un espacio de fases."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Una vez entendidas las bases de un oscilador armónico, podremos proseguir con la definición, ahora sí, de los sistemas que se han implementado."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "simple-pendulum": [
    {
      "text": {
        "title": "Definicion",
        "content": "Un péndulo simple es un oscilador armónico formado por un hilo rígido de longitud L y de masa despreciable del que cuelga una masa m, moviéndose de manera armónica alrededor de la normal al plano, con un ángulo θ respecto del eje perpendicular."
      },
      "image": {
        "src": "simple-pendulum/simple-pendulum.png",
        "alt": "Figura 1: Esquema del péndulo simple"
      }
    },
    {
      "text": {
        "title": "",
        "content": "El péndulo simple se define mediante la siguiente expresión, que se obtiene a partir de la relación entre energía potencial y energía cinética. Usando el principio de conservación de la energía, podemos deducir mediante el lagrangniano del sistema que el resultado obtenido es una EDO de segundo orden."
      },
      "image": {
        "src": "simple-pendulum/image106.png",
        "alt": "Figura 2: Ecuación del movimiento"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Un péndulo simple es un sistema no lineal debido a la presencia de la función seno en la expresión. Su posición en cualquier instante t viene dado por una composición de momentos armónicos en los ejes XY."
      },
      "image": {
        "src": "simple-pendulum/image109.png",
        "alt": "Figura 3: Posición del péndulo"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Cuando el sistema se encuentra en el punto más alto de su recorrido, su energía potencial es máxima y se define mediante la siguiente expresión a lo largo de todo su movimiento."
      },
      "image": {
        "src": "simple-pendulum/image111.png",
        "alt": "Figura 4: Energía potencial"
      }
    },
    {
      "text": {
        "title": "Solución exacta",
        "content": "Conociendo la no linealidad del sistema, el movimiento se vuelve irresoluble por métodos tradicionales de cálculo, teniendo que recurrir a métodos de aproximación numérica para obtener valores aproximados, pero no exactos, como por ejemplo usando alguno de los métodos de Runge-Kutta. La definición del periodo, el tiempo que tarda en volver a su estado inicial, también vendrá sujeta a diferentes condiciones, y será definida por la siguiente expresión. "
      },
      "image": {
        "src": "simple-pendulum/image112.png",
        "alt": "Figura 5: Expresión exacta del periodo"
      }
    },
    {
      "text": {
        "title": "",
        "content": "El término integral se conoce como integral elíptica de primera especie, que no es más que una manera de medir el tiempo que se tarda en recorrer el arco completo de una elipse, siendo k el módulo elíptico o excentricidad del giro."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Existen maneras de aproximar o resolver este tipo de integrales, como por ejemplo aproximando mediante series de Taylor o mediante el cálculo iterativo de la media aritmético-geométrica. Otra opción menos costosa puede ser usar algunas aproximaciones previamente calculadas del periodo, pero dan lugar a cierto error. Estos métodos de resolución quedan explicados en el apartado de herramientas. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Aun con la no linealidad, es posible encontrar una solución al sistema recurriendo al concepto de la integral elíptica. Necesitamos partir de la EDO inicial y a través de la energía se intenta linealizar el sistema, llegando a esta expresión."
      },
      "image": {
        "src": "simple-pendulum/image114.png",
        "alt": "Figura 6: Solución exacta para v = 0"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Es una ecuación que, teóricamente, funciona de manera óptima mientras el ángulo tienda al mínimo. De manera experimental, sólo es práctica si el ángulo inicial es menor a 135º. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Como se puede observar, aparece un nuevo término en la función: el seno elíptico de Jacobi, que define a qué altura de una elipse nos encontramos, sería el equivalente al seno trigonométrico en una circunferencia; y K(x), que es la integral elíptica de primera especie, la misma que en el periodo. El seno de Jacobi también puede ser aproximado mediante la media aritmético-geométrica, aunque existen consideraciones que pueden aplicarse, como aproximaciones para ángulos muy pequeños o muy grandes, comportándose como un sistema lineal. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "cradle-pendulum": [
    {
      "text": {
        "title": "Definicion",
        "content": "Una representación cotidiana de un péndulo simple puede verse en un particular sistema denominado Cuna de Newton o Péndulo de Newton. Es un sistema formado por N péndulos simples que, en estado de reposo, permanecen juntos, pero en estado de movimiento, el choque entre los diferentes elementos produce un intercambio del momento que se ve reflejado en el clásico movimiento."
      },
      "image": {
        "src": "cradle-pendulum/cradle-pendulum.png",
        "alt": "Figure 1: Esquema de la cuna de Newton"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Y es tan sencillo como un intercambio de momento a través del choque. Para explicarlo se utilizará un esquema sencillo, considerando sólo el eje horizontal."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "En un choque frontal de dos elementos con la misma masa y la misma aceleración, sin rozamiento, las fuerzas ejercidas resultarán en 0, y a su vez, el momento ejercido también se hará nulo. Si esto no ocurriese, no se cumpliría con la conservación de la energía. Por tanto, podemos suponer que, si uno de los elementos no ejerciera una fuerza igual y contraria a la del otro elemento, éste traspasará su fuerza y momento al otro, para cumplir con que la relación de momentos sea conservativa. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Además de esto, debemos considerar que el choque será elástico, es decir, la energía cinética también se traspasa en el choque de manera equivalente, es decir, se conserva."
      },
      "image": {
        "src": "cradle-pendulum/image121.png",
        "alt": "Figure 2: Traspaso de velocidad en el choque para masa igual a 1"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Con estas dos expresiones podemos conocer cómo se realiza el traspaso de momento de un cuerpo a otro tras un choque y la velocidad final resultante. Así por ejemplo en un sistema de 4 elementos, si dos se moviesen en dirección hacia el resto a una velocidad constante, tras el choque se produciría un traspaso de momento y energía cinética a los dos cuerpos que estaban en reposo, haciendo que éstos comenzaran a moverse y los dos iniciales se detuvieran."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Volviendo al sistema armónico inicial, usando el mismo ejemplo de las cuatro bolas, sólo necesitamos conocer la velocidad en el instante en el que los péndulos que se encontraran oscilando y la masa de éstos para poner en marcha con una velocidad igual a los otros dos, contrarrestando la velocidad de los dos primeros."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "double-pendulum": [
    {
      "text": {
        "title": "Introducción",
        "content": "Todos los modelos aquí presentados tienen algo en común, su comportamiento puede ser de una manera o de otra predecible. Eso quiere decir que independientemente de las condiciones iniciales podremos determinar con total certeza cual será el siguiente movimiento y que la trayectoria definida siempre será conocida con antelación. Estos sistemas son conocidos como deterministas, es decir, que pueden preverse."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Aun así, existen fenómenos físicos en la naturaleza que, aun respondiendo a una naturaleza determinista, nos impiden relacionar las condiciones iniciales con la trayectoria que van a seguir en un futuro, describiéndose como movimientos aparentemente azarosos. Estos sistemas son conocidos como sistemas caóticos, en el que la variación mínima de las condiciones iniciales responde con un comportamiento, aunque determinista, totalmente distintos al que ocurría con otras condiciones iniciales."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "Teoría del caos",
        "content": "La teoría del caos es la rama de las matemáticas encargada de estudiar los comportamientos dinámicos altamente sensibles a las condiciones iniciales. Estos sistemas se presentan en la naturaleza de distintas maneras y pueden darse tanto de una manera azarosa, en la que la gran cantidad de variables los vuelven totalmente impredecibles, o de una manera determinista, en los que su comportamiento con unas condiciones iniciales será completamente distinto del de otras, divergiendo completamente en la solución. ¿Pero qué condiciones deben darse para que un sistema sea caótico?<br/><ul><li>Sensibilidad a las condiciones iniciales: Como ya hemos comentado un sistema caótico es aquel en el que la leve variación de sus condiciones iniciales da como resultado cambios enormes en el comportamiento del sistema. Esto es conocido popularmente como Efecto mariposa.</li><li>Mezcla topológica: Un sistema no caótico mantiene un espacio de fases separado en regiones independientes. En un sistema caótico estas regiones terminan superponiéndose en algún instante de la evolución del sistema.</li><li>Movimiento oscilante: Un sistema caótico no se ajusta a órbitas cerradas ni puntos fijos.</li><ul>"
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Otro concepto importante a la hora de comprender los sistemas caóticos es el atractor. Un atractor comprende un conjunto de valores numéricos o soluciones en el espacio de fases al que se tiende a lo largo del tiempo."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "Péndulo doble",
        "content": "Una vez comprendidos algunos conceptos básicos de la teoría del caos, vamos a simular un ejemplo clásico de la misma: el péndulo doble. "
      },
      "image": {
        "src": "double-pendulum/double-pendulum.png",
        "alt": "Figura 1: Esquema del péndulo doble"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Un péndulo doble es un sistema caótico determinista, en el que la variación inicial de sus condiciones iniciales da resultados dispares. Este sistema está formado por un péndulo compuesto, al igual que el péndulo simple, por una cuerda rígida de longitud L y masa despreciable del que cuelga una bola de masa m, aunque de esta bola cuelga otro péndulo de similares características. Su posición en el espacio se define mediante estas cuatro ecuaciones, dos para cada péndulo, que variarán en función del ángulo."
      },
      "image": {
        "src": "double-pendulum/image124.png",
        "alt": "Figura 2: Posición del péndulo"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Debido a su naturaleza oscilatoria podremos modelar su movimiento de la misma manera que un péndulo simple, a partir del lagrangniano conformado por sus energías, obteniendo dos EDOs."
      },
      "image": {
        "src": "double-pendulum/image128.png",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
        "src": "double-pendulum/image129.png",
        "alt": "Figura 3: Ecuaciones del movimiento"
      }
    }
  ],
  "triple-pendulum": [
    {
      "text": {
        "title": "Péndulo triple",
        "content": "Otro ejemplo no tan conocido, pero de igual comportamiento que el péndulo doble, es el péndulo triple."
      },
      "image": {
        "src": "triple-pendulum/triple-pendulum.png",
        "alt": "Figure 1: Esquema del péndulo triple"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Su composición es igual a la del péndulo doble, pero del que a su vez cuelga una nueva masa que oscila en consonancia con el resto produciendo de nuevo un movimiento caótico ya que, la más leve variación de sus condiciones iniciales resultará en trayectorias completamente diferentes. La posición de las masas queda determinada por las siguientes fórmulas:"
      },
      "image": {
        "src": "triple-pendulum/image131.png",
        "alt": "Figura 2: Posición del péndulo triple"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Y de manera similar, podremos determinar su ecuación del movimiento gracias al lagrangniano del sistema, que resulta en una serie de ecuaciones que comienzan a volverse bastante extensas. "
      },
      "image": {
        "src": "triple-pendulum/image137.png",
        "alt": "Figura 3: Ecuaciones del movimiento"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Para aplicar los métodos numéricos será necesario extenderlas en función de la ecuación que se quiera resolver. Para facilitar la tarea podemos utilizar cualquier software que nos proporcione opciones de resolución de ecuaciones de manera simbólica. En nuestro caso se ha usado Sage para llevar a cabo esta tarea."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "spherical-pendulum": [
    {
      "text": {
        "title": "Definicion",
        "content": "El péndulo esférico es un sistema similar al péndulo simple, pero al que se ha añadido un grado de libertad. Un hilo rígido de longitud L y de masa despreciable del que cuelga una masa m, con un ángulo θ respecto del eje perpendicular que definirá la amplitud, la normal al plano XY en este caso; y un ángulo φ, que definirá la rotación realizada alrededor de la normal."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Añadir una nueva coordenada hace replantear cómo debemos atacar el problema y, en este caso, el péndulo ha sido modelado mediante coordenadas esféricas. Esto resultará en ciertas condiciones más adelante."
      },
      "image": {
        "src": "spherical-pendulum/spherical-pendulum.png",
        "alt": "Figura 1: Esquema del péndulo esférico"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Al igual que en el péndulo simple, la obtención de las ecuaciones que definen el movimiento del sistema partirá de la energía potencial y la energía cinética, construyendo con ellas el lagrangniano. Tras derivar por el ángulo de amplitud y el ángulo de rotación obtenemos las siguientes EDO."
      },
      "image": {
        "src": "spherical-pendulum/image143.png",
        "alt": "Figura 2: Ecuaciones del movimiento"
      }
    },
    {
      "text": {
        "title": "",
        "content": "El péndulo esférico actuará de la misma manera que lo hace un péndulo simple siempre y cuando no ejerzamos una fuerza de rotación, φ diferente de 0. En caso contrario, el péndulo comenzará a oscilar, produciendo esas figuras en forma de cuenco tan características.  "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Aun así, podremos comprobar cómo uno de los términos se encuentra multiplicado por la cotangente de la amplitud, y es que existe el problema para este modelado de que la cotangente tiende a infinito al acercarse a 0, por tanto, una vez aplicamos una fuerza de rotación, debemos considerar que no sea demasiado baja, ya que entonces el movimiento oscilatorio degenerará y no continuará con el movimiento."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "Pendulo de Focault",
        "content": "Existe un caso especial del péndulo esférico, el cual es denominado, péndulo de Foucault. Las oscilaciones producidas por este péndulo son debidas a la rotación de la tierra y a la inclinación que el péndulo tenga con respecto al eje terrestre. En este caso, las EDO que definen al péndulo esférico pueden ser sustituidas por una composición de movimientos armónicos simples para los ejes X e Y. Así que suponiendo un lugar en el planeta y teniendo en cuenta parámetros como la rotación de la tierra, podemos llegar hasta las ecuaciones que definen el movimiento del péndulo, donde ω_p es la frecuencia angular y ω es la velocidad de rotación."
      },
      "image": {
        "src": "spherical-pendulum/image148.png",
        "alt": "Figura 3: Movimiento del péndulo de Focault"
      }
    }
  ],
  "conical-pendulum": [
    {
      "text": {
        "title": "Definicion",
        "content": "El péndulo cónico es un sistema similar al péndulo esférico. Una masa m que cuelga de una varilla rígida de longitud L y se desplaza con tres grados de libertad, una amplitud de valor θ en el eje Z y una rotación sobre el plano XY de valor θ."
      },
      "image": {
        "src": "conical-pendulum/conical-pendulum.png",
        "alt": "Figura 1: Esquéma del péndulo cónico"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Pero a diferencia del péndulo esférico, un péndulo cónico no realiza un movimiento armónico, si no un movimiento circular uniforme producido por una fuerza centrífuga que hará que el péndulo comience a rotar. Esta fuerza centrífuga es producida por un aumento de la velocidad de rotación, o frecuencia angular, ω. Cuando esta velocidad alcanza un valor crítico, el péndulo abandona el estado de reposo y comienza a elevarse, girando alrededor del eje Z."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "Para modelar el péndulo cónico partimos de la tensión del sistema, suponiendo una masa que se encuentra en equilibrio en el eje central."
      },
      "image": {
        "src": "conical-pendulum/image152.png",
        "alt": "Figura 2: Fórmula del periodo"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Sabemos que existe una relación entre la frecuencia angular del modelo que produce la fuerza centrípeta y la tensión producida por el hilo que sujeta la masa. Esta aceleración, descrita por la masa corresponde la de un movimiento circular uniforme. "     
      },
      "image": {
        "src": "conical-pendulum/image153.png",
        "alt": "Figura 3: Aceleración centrípeta"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Sólo necesitamos igualar ambas expresiones a través de la segunda ley de Newton para obtener dos soluciones, una correspondiente al sistema en reposo, sin alcanzar la velocidad crítica y otra en movimiento."     
      },
      "image": {
        "src": "conical-pendulum/image154.png",
        "alt": "Figura 4: Estados del péndulo"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Una vez conocida la expresión que indica cómo se mueve el péndulo, debemos también averiguar cuál es la expresión que representa esa velocidad crítica que se debe alcanzar, que dependerá de la energía del sistema. Cuando la energía alcance su valor crítico entonces podremos decir que el péndulo comienza a moverse. Este valor crítico de la velocidad se consigue mediante la siguiente expresión."     
      },
      "image": {
        "src": "conical-pendulum/image156.png",
        "alt": "Figura 5: Frecuencia angular crítica"
      }
    }
  ],
  "spring-pendulum": [
    {
      "text": {
        "title": "Definicion",
        "content": "Los movimientos amortiguados corresponden a movimientos armónicos simples en los que existen una serie de fuerzas externas, producidas generalmente por un muelle, en la cual una “empuja” la masa a un ritmo constante k y otra que resiste la expansión del muelle, de igual constante, pero de signo contrario, que devuelve al sistema a su estado inicial y lo mantienen en oscilación."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "El péndulo amortiguado es un oscilador armónico formado por un muelle de longitud L y masa despreciable del que pende una masa m. El muelle tiene una constante elástica k que le permite elongarse hasta una longitud x. Este sistema se mueve en los ejes XY, siendo modelado por la unión de dos modos de oscilación, la de un péndulo simple, en el movimiento oscilante; y la de un muelle elástico, en el movimiento de contracción. "
      },
      "image": {
        "src": "spring-pendulum/spring-pendulum.png",
        "alt": "Figura 1: Esquéma del péndulo amortiguado"
      }
    },
    {
      "text": {
        "title": "",
        "content": "A diferencia del péndulo simple y debido a sus dos grados de libertad, se define por dos ecuaciones de movimiento, una que indica cómo varía el ángulo con respecto a la vertical y otra cómo varía la elongación del muelle. Estas expresiones se obtienen a través del lagrangniano que aúna las energías potenciales y cinéticas de los dos movimientos. La energía potencial del péndulo será 0 sólo cuando el sistema esté en reposo, por ejemplo, algún estado en el que la elongación x se encuentre a 0. Debido a la no linealidad del sistema, no se puede dar una representación exacta del movimiento, por ello será necesario el uso de métodos numéricos de aproximación."
      },
      "image": {
        "src": "spring-pendulum/image118.png",
        "alt": "Figura 2: Ecuaciones del movimiento"
      }
    }
  ],
  "euler": [
    {
      "text": {
        "title": "Introducción a los métodos numéricos",
        "content": "Durante todo el proyecto realizaremos una serie de simulaciones que vendrán modeladas en base a una o varias ecuaciones diferenciales ordinarias, que se obtendrán en apartados siguientes. Las EDO son ecuaciones diferenciales en las que una función y una sola variable independiente, por ejemplo, x(t), se relaciona con sus derivadas. Las EDO nos sirven para comprender cómo varían ciertas variables físicas. Un ejemplo básico sería la velocidad, que se obtiene en base a la derivada de la posición con respecto al tiempo. O la aceleración, que se obtiene con respecto a la segunda derivada de la posición, o en base a la velocidad."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "En muchas ocasiones estas ecuaciones no pueden resolverse por medio de métodos analíticos; en otras, simplemente no necesitamos el resultado exacto de la expresión y puede servirnos una aproximación. Para estos casos existen los llamados métodos numéricos de resolución para EDO. Estos métodos se encargan de buscar valores aproximados de la solución de manera iterativa, haciéndola crecer en función de un paso y son ideales a la hora de realizar simulaciones por ordenador. "
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": "El paso se define como la diferencia entre dos instantes de tiempo (o la variable independiente que se suponga) dividido entre el número de intervalos que queramos producir."
      },
      "image": {
        "src": "euler/image006.png",
        "alt": "Figura 1: Paso entre soluciones"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Con esta introducción y el concepto de paso en mente, haremos un repaso por alguno de estos métodos más conocidos y que, como veremos, llevan mucho tiempo entre nosotros."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "Método de Euler",
        "content": "El primero de los métodos de numéricos de aproximación creado es el método de Euler. Tratado por primera vez en 1768 en su libro Institutionum calculi integralis, Euler planteó un método de resolución para EDO donde la derivada se aproxima mediante un cociente incremental. Consecutivos cálculos sobre el método darán como resultado una sucesión de puntos que corresponderán a una aproximación de la curva dada. Este método se define mediante la siguiente expresión, donde y(x_0) es el dato inicial:"
      },
      "image": {
        "src": "euler/image008.png",
        "alt": "Figura 2: Método de Euler"
      }
    },
    {
      "text": {
        "title": "",
        "content": "El método de Euler no se encuentra exento de errores, ya que cuanto mayor sea el valor de h, más nos alejaremos de la curva exacta obteniendo peores aproximaciones consecuentemente; y en caso de suponer un paso muy pequeño, deberemos considerar el posible coste computacional que acarrearía esta decisión."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "heun": [
    {
      "text": {
        "title": "Método de Heun",
        "content": "Similar al primer método nos encontramos con el método de Heun, o Euler modificado, que resulta en una mejora del método de Euler, donde nuevos términos aparecen:"
      },
      "image": {
        "src": "heun/image010.png",
        "alt": "Figura 1: Estimaciones de la derivada"
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
		"src": "heun/image012.png",
        "alt": "Figura 2: Media de las dos estimaciones"
      }
    },
    {
      "text": {
        "title": "",
        "content": "En esta ocasión no solo nos encontramos con la estimación de una sola pendiente sino 2, donde  (k1) y (k2) son una aproximación de la derivada en dos pasos consecutivos respectivamente. La media de estas dos pendientes dará como resultado un nuevo punto cercano a la curva exacta y una aproximación más precisa a la del método de Euler."
      },
      "image": {
		"src": "heun/image012.png",
        "alt": "Figura 2: Media de las dos estimaciones"
      }
    }
  ],
  "rungeKutta4": [
    {
      "text": {
        "title": "Runge-Kutta de orden 4",
        "content": "El método de Runge-Kutta clásico, Runge-Kutta de 4 orden o simplemente RK4, es el método más ampliamente usado de entre todos los métodos de aproximación numérica. Su planteamiento presenta una evolución al presentado en el método de Euler, siendo esta una variación en la que nos encontramos con cuatro pasos previos hasta llegar a la aproximación."
      },
      "image": {
		"src": "runge-kutta-4/image015.png",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
		"src": "runge-kutta-4/image016.png",
        "alt": "Figura 1: Método de Runge-Kutta"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Similar al concepto de Heun, esta vez se estimarán cuatro pendientes para las que se realizarán sendas aproximaciones de la derivada (k1,k2,k3,k4) en dos pasos consecutivos y dos intermedios, donde la media de estas aproximaciones dará como resultado la aproximación final, obteniendo un error mucho menor que en métodos anteriores."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "rungeKuttaFehlberg45": [
    {
      "text": {
        "title": "Tableros de Butcher",
        "content": "Existe toda una familia de métodos derivados del método de Runge-Kutta ya que es posible generalizar la estructura de este método para construir otros equivalentes de una manera sencilla y con una variación del error diferente, mediante el conocido como Tablero de Butcher, en el que a partir de unos pesos determinados podemos obtener una matriz de valores que conformarán el método. La siguiente expresión define la forma generalizada de cada una de las soluciones obtenidas en el método. Como vemos, se parte directamente del método de Euler, al que se han añadido los valores a_(s,n),b_(n )y c_s, siendo, los dos últimos el peso de la solución y la variación del tamaño del paso, mientras que el primer valor se calculará en torno a los demás."
      },
      "image": {
        "src": "runge-kutta-fehlberg/image020.png",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
        "src": "runge-kutta-fehlberg/butcher1.png",
        "alt": "Figura 1: Composición del tablero de Butcher"
      }
    },
    {
      "text": {
        "title": "",
        "content": "Así, por ejemplo, usando la estructura anterior podemos construir el tablero de Butcher del método de Runge-Kutta."
      },
      "image": {
        "src": "runge-kutta-fehlberg/butcher2.png",
        "alt": "Figura 2: Tablero de Butcher para RK4"
      }
    },
    {
      "text": {
        "title": "Runge-Kutta-Fehlberg de orden 4 y 5",
        "content": "Partiendo de este esquema es posible construir otros métodos. Uno muy interesante y bastante usado en simulaciones es el método de Runge-Kutta-Fehlberg de orden 4 y 5, que usa dos aproximaciones, una de orden 4 y otra de orden 5. El tablero de Butcher nos permite representarlo sin ocupar demasiado espacio, de otra manera, se extendería demasiado."
      },
      "image": {
        "src": "runge-kutta-fehlberg/butcher3.png",
        "alt": "Figura 2: Tablero de Butcher para RKF45"
      }
    },
    {
      "text": {
        "title": "",
        "content": "En este método se juega con la idea del paso adaptativo, el incremento o decremento del paso en cada iteración, comparando el error producido por sus dos aproximaciones. Tomando una tolerancia al error como referencia, si el error producido por ambas aproximaciones es menor, entonces el paso será optimo; en caso contrario será necesario variar el paso y recalcular la solución tantas veces sea necesario para así obtener una solución con el mínimo error. Este paso adaptativo se realiza en cada iteración."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    }
  ],
  "agm": [
    {
      "text": {
        "title": "Média aritmético-geométrica",
        "content": "Otra herramienta que resulta de utilidad, sobre todo a la hora de aproximar integrales, es la conocida como media aritmético-geométrica. En este método se realiza de manera iterativa la media aritmética y la media geométrica de dos valores hasta hacerlos converger en el mismo valor."
      },
      "image": {
        "src": "",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
        "src": "agm/image076.png",
        "alt": ""
      }
    },
    {
      "text": {
        "title": "",
        "content": ""
      },
      "image": {
        "src": "agm/image077.png",
        "alt": "Figura 1: Proceso de la média aritmético-geométrica"
      }
    }
  ]

}
